# PANDAS

# pandas ===> It  is an open source library that is used for handle data manipulation

In [1]:
#data structure
# 1.) Series  2.) Data Frame

# 1.) Series

In [2]:

import pandas as pd
a=pd.Series([1,2,33,4])
a

0     1
1     2
2    33
3     4
dtype: int64

In [3]:
type(a)

pandas.core.series.Series

# 2.) Data Frame

In [4]:
a={
    "Emp_id":[1,2,3,4,5,6,7,8],
    "Name":["Avneet","Rahul","divyanshu","Deepak","Aditya","Aryan","Raj","Mohit"],
    "Department":["IT","HR","HR","IT","HR","OPERATIONS","IT","IT"],
    "WORKING_HOURS" :[8,9,9,9,9,9,9,9]

    
}

In [5]:
a

{'Emp_id': [1, 2, 3, 4, 5, 6, 7, 8],
 'Name': ['Avneet',
  'Rahul',
  'divyanshu',
  'Deepak',
  'Aditya',
  'Aryan',
  'Raj',
  'Mohit'],
 'Department': ['IT', 'HR', 'HR', 'IT', 'HR', 'OPERATIONS', 'IT', 'IT'],
 'WORKING_HOURS': [8, 9, 9, 9, 9, 9, 9, 9]}

In [6]:
type(a)

dict

In [24]:
df.columns #give all the columns of data

Index(['Emp_id', 'Name', 'Department', 'WORKING_HOURS'], dtype='object')

In [8]:
df=pd.DataFrame(a)
df

   Emp_id       Name  Department  WORKING_HOURS
0       1     Avneet          IT              8
1       2      Rahul          HR              9
2       3  divyanshu          HR              9
3       4     Deepak          IT              9
4       5     Aditya          HR              9
5       6      Aryan  OPERATIONS              9
6       7        Raj          IT              9
7       8      Mohit          IT              9

In [13]:
df.head() #  by default return top 5 data

   Emp_id       Name Department  WORKING_HOURS
0       1     Avneet         IT              8
1       2      Rahul         HR              9
2       3  divyanshu         HR              9
3       4     Deepak         IT              9
4       5     Aditya         HR              9

In [14]:
df.head(2) # now it will return top 2 data

   Emp_id    Name Department  WORKING_HOURS
0       1  Avneet         IT              8
1       2   Rahul         HR              9

In [11]:
df.tail() # by default return bottom 5 data

   Emp_id    Name  Department  WORKING_HOURS
3       4  Deepak          IT              9
4       5  Aditya          HR              9
5       6   Aryan  OPERATIONS              9
6       7     Raj          IT              9
7       8   Mohit          IT              9

In [12]:
df.tail(2)

   Emp_id   Name Department  WORKING_HOURS
6       7    Raj         IT              9
7       8  Mohit         IT              9

In [15]:
df.sample(4) # it returns random-indexed rows

   Emp_id       Name Department  WORKING_HOURS
1       2      Rahul         HR              9
2       3  divyanshu         HR              9
4       5     Aditya         HR              9
3       4     Deepak         IT              9

In [22]:
df.describe() ## it return statically view of data

        Emp_id  WORKING_HOURS
count  8.00000       8.000000
mean   4.50000       8.875000
std    2.44949       0.353553
min    1.00000       8.000000
25%    2.75000       9.000000
50%    4.50000       9.000000
75%    6.25000       9.000000
max    8.00000       9.000000

In [23]:
df.info() # complete overview of data

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Emp_id         8 non-null      int64
 1   Name           8 non-null      object
 2   Department     8 non-null      object
 3   WORKING_HOURS  8 non-null      int64
dtypes: int64(2), object(2)
memory usage: 388.0+ bytes

In [ ]:
# if you want to export your data into csv file

In [27]:
df.to_csv("C:\\Users\\Lenovo\\Documents\\Summer internship\\Machine Learning\\Emp.info.csv")  
#in this a extra colun will be added

In [28]:
df.to_csv("C:\\Users\\Lenovo\\Documents\\Summer internship\\Machine Learning\\Emp.info2.csv",index=False) 
# in this extra couln will not be added

In [60]:
df.to_excel("C:\\Users\\Lenovo\\Documents\\Summer internship\\Machine Learning\\old_Emp_info.xlsx")

ModuleNotFoundError: No module named 'openpyxl'

# how to read a csv file into jupyter notebook

In [33]:
df=pd.read_csv("C:\\Users\\Lenovo\\Documents\\Summer internship\\Machine Learning\\Emp.info2.csv")

In [34]:
df

   Emp_id       Name  Department  WORKING_HOURS
0       1     Avneet          IT              8
1       2      Rahul          HR              9
2       3  divyanshu          HR              9
3       4     Deepak          IT              9
4       5     Aditya          HR              9
5       6      Aryan  OPERATIONS              9
6       7        Raj          IT              9
7       8      Mohit          IT              9

In [35]:
df['Department']

0            IT
1            HR
2            HR
3            IT
4            HR
5    OPERATIONS
6            IT
7            IT
Name: Department, dtype: object

In [38]:
df['Department'].value_counts() # count values

Department
IT            4
HR            3
OPERATIONS    1
Name: count, dtype: int64

In [39]:
df["Name"][0]

'Avneet'

In [47]:
df["Name"][0:3]

0      newname
1        Rahul
2    divyanshu
Name: Name, dtype: object

In [40]:
df["Name"][0]="newname"

C:\Users\Lenovo\AppData\Local\Temp\ipykernel_8384\2319257211.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df["Name"][0]="newname"

In [41]:
df

   Emp_id       Name  Department  WORKING_HOURS
0       1    newname          IT              8
1       2      Rahul          HR              9
2       3  divyanshu          HR              9
3       4     Deepak          IT              9
4       5     Aditya          HR              9
5       6      Aryan  OPERATIONS              9
6       7        Raj          IT              9
7       8      Mohit          IT              9

In [50]:
# raj working hour ==7
df["WORKING_HOURS"][6]=7

C:\Users\Lenovo\AppData\Local\Temp\ipykernel_8384\1547126114.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df["WORKING_HOURS"][6]=7

In [51]:
df

   Emp_id       Name  Department  WORKING_HOURS
0       1    newname          IT              8
1       2      Rahul          HR              9
2       3  divyanshu          HR              9
3       4     Deepak          IT              9
4       5     Aditya          HR              9
5       6      Aryan  OPERATIONS              9
6       7        Raj          IT              7
7       8      Mohit          IT              9

In [52]:
# loc and iloc
#df.loc["row_range","column_name"]
#df.iloc["row_range","column_range"]

In [54]:
df.loc[2:5,["Name","Department"]] # in this last index is also included

        Name  Department
2  divyanshu          HR
3     Deepak          IT
4     Aditya          HR
5      Aryan  OPERATIONS

In [56]:
df.iloc[2:5,1:3] # last index is not included

        Name Department
2  divyanshu         HR
3     Deepak         IT
4     Aditya         HR

C:\Users\Lenovo\AppData\Local\Temp\ipykernel_8384\4093952719.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df["Name"][2]=None # creating missing value

In [71]:
df["Name"][3]=None # creating missing value
df["Department"][3]=None
df["Department"][4]=None

C:\Users\Lenovo\AppData\Local\Temp\ipykernel_8384\2059317351.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df["Name"][3]=None # creating missing value
C:\Users\Lenovo\AppData\Local\Temp\ipykernel_8384\2059317351.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df["Department"][3]=None
C:\Users\Lenovo\AppData\Local\Temp\ipykernel_8384\2059317351.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df["Department"][4]=None

In [72]:
df.isnull() # it returns the True for missing/none values and false for other values

   Emp_id   Name  Department  WORKING_HOURS
0   False  False       False          False
1   False  False       False          False
3   False   True        True          False
4   False  False        True          False
5   False  False       False          False
6   False  False       False          False
7   False  False       False          False

In [76]:
df.isnull().sum() # give no of none values in each column

Emp_id           0
Name             0
Department       0
WORKING_HOURS    0
dtype: int64

In [74]:
df=df.dropna() # will drop all the null values

In [75]:
df

   Emp_id     Name  Department  WORKING_HOURS
0       1  newname          IT              8
1       2    Rahul          HR              9
5       6    Aryan  OPERATIONS              9
6       7      Raj          IT              7
7       8    Mohit          IT              9